dbase = [
    '+5(4671)849-6225',
    '+394(63)128-1148',
    '535(02)715-68-89',
    '+72(23)661-8520',
    '+194(455)628-2961',
    '092158146777',
    '+862(179)416-6138',
    '+3(2697)794-4711',
    '+98(393)874-4458',
    '+5(07)958-7521',
    '+3(632)626-8042',
    '+7611528-9013',
    '+88135130-7172',
    '94(3005)670-58-48',
    '+264925558-7301',
    '58(6929)091-8491',
    '+581(067)254-6659',
    '+4(838)997-1720',
    '+7(163)228-1948',
    '72236618520',
    '507958-7521',
    '967(28)959-4951',
    '+53(2121)207-3793',
    '+80(922)2856718',
    '7121-2173999'
]
ru_list = []
for index, phone in enumerate(dbase):
    phone = phone.replace('+', '').replace('-', '').replace('(', '').replace(')', '')
    dbase[index] = phone
set(list(dbase))
maxi = max(map(int, dbase))
for index , phone in enumerate(dbase):
    if len(phone[:-10]) != 0:
        dbase[index] = phone[:-10],phone[-10:-7], phone[-7:]

    if phone[:-10]  == '7':
        ru_list.append(phone)
dbase = tuple(dbase)
print(dbase)
print('Рф лист: ', ru_list)
print('В базе: ', len(dbase), 'номеров')
print('В базе: ', phone[:-10], 'стран')
print('Самый длинный номер: ', maxi, 'состоит из ', len(str(maxi)),  'цифр')
